# Pandas

In [1]:
#Pandas is an open source, BSD-licensed library providing high-performance, easy-to-use data structures and data analysis tools for the Python programming language

In [2]:
#import pandas and numpy
import pandas as pd
import numpy as np

In [10]:
#syntax
#pd.DataFrame(values),index[,,],columns[,,] index is row names

In [16]:
#creating our own dataframe(df)
df=pd.DataFrame(np.arange(0,20).reshape(5,4),index=['Row1','Row2','Row3','Row4','Row5'],columns=['column1','column2','column3','column4'])

In [17]:
df

      column1  column2  column3  column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [15]:
df1=pd.DataFrame(np.arange(0,30).reshape(5,6),index=['row1','row2','row3','row4','row5'],columns=['c1','c2','c3','c4','c5','c6'])

In [18]:
df1

      c1  c2  c3  c4  c5  c6
row1   0   1   2   3   4   5
row2   6   7   8   9  10  11
row3  12  13  14  15  16  17
row4  18  19  20  21  22  23
row5  24  25  26  27  28  29

In [20]:
df1.head() #for getting first 5 from dataframe

      c1  c2  c3  c4  c5  c6
row1   0   1   2   3   4   5
row2   6   7   8   9  10  11
row3  12  13  14  15  16  17
row4  18  19  20  21  22  23
row5  24  25  26  27  28  29

In [22]:
df1.tail() #for getting last 5 from dataframe output same we have less rows

      c1  c2  c3  c4  c5  c6
row1   0   1   2   3   4   5
row2   6   7   8   9  10  11
row3  12  13  14  15  16  17
row4  18  19  20  21  22  23
row5  24  25  26  27  28  29

In [24]:


## Accessing the elements

df.loc['Row1']
#loc is location

column1    0
column2    1
column3    2
column4    3
Name: Row1, dtype: int64

In [25]:
## Check the type

type(df.loc['Row1'])

pandas.core.series.Series

In [26]:
df.iloc[:,:]
#iloc is index location

      column1  column2  column3  column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [27]:
#convert Dataframes into array
df.iloc[:,1:].values

array([[ 1,  2,  3],
       [ 5,  6,  7],
       [ 9, 10, 11],
       [13, 14, 15],
       [17, 18, 19]])

In [28]:
type(df.iloc[:,:])

pandas.core.frame.DataFrame

In [32]:
df.loc[['Row1','Row2']]

      column1  column2  column3  column4
Row1        0        1        2        3
Row2        4        5        6        7

In [34]:
type(df.loc[['Row1','Row2']]) #now its convereted to dataframe

pandas.core.frame.DataFrame

In [35]:
#the difference between series and dataframe is that series only has either 1 row or column 
# if there are more than 1 then its df

In [37]:
df['column1'].value_counts()

0     1
4     1
8     1
12    1
16    1
Name: column1, dtype: int64

In [38]:
df['column2'].unique()

array([ 1,  5,  9, 13, 17])